// ITMO.SoftwareEng2023.C++
// Контрольные задания. 
// Задание 1. Расчет площади многоугольника
//

#include <iostream>
#include<cmath>

using namespace std;

int main()
{
	system("chcp 1251");
	int x1, y1, x2, y2, x3, y3, x4, y4, x5, y5, s;
	cout << "Введите координаты x1 и y1 первой точки через пробел\n";
	cin >> x1 >> y1;
	cout << "Введите координаты x2 и y2 второй точки через пробел\n";
	cin >> x2 >> y2;
	cout << "Введите координаты x3 и y3 третьей точки через пробел\n";
	cin >> x3 >> y3;
	cout << "Введите координаты x4 и y4 четвертой точки через пробел\n";
	cin >> x4 >> y4;
	cout << "Введите координаты x5 и y5 пятой точки через пробел\n";
	cin >> x5 >> y5;
	s = 0.5 * abs(x1 * y2 + x2 * y3 + x3 * y4 + x4 * y5 + x5 * y1 - 
		x2 * y1 - x3 * y2 - x4 * y3 - x5 * y4 - x1 * y5);
	cout << "Площадь пятиугольника: " << s << endl;
	return 0;
}